pokemon-soap/request.xml

   
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
<soapenv:Header/>
   <soapenv:Body>
      <gs:helloRequest>
         <gs:name>Spain</gs:name>
      </gs:helloRequest>
   </soapenv:Body>
</soapenv:Envelope>
